[A_NaturesRevenge_CreatureAbility_3_Master H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName=""
mTooltip=""

[A_NaturesWrath_Buff H7BaseBuff]
mName="自然之怒"
mTooltip=""

[A_NaturesRevenge_WarfareUnitAbility_2_Expert H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="自然标记施加能力"
mTooltip=""

[A_FastReload_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="快速装填"
mTooltip="森林弩车对其目标施加一个标记。它在攻击被标记的生物后获得第二次攻击。"

[A_NaturesWrath_Buff_2Marks H7BaseBuff]
mName="自然之怒"
mTooltip=""

[A_NaturesWrath_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="自然之怒"
mTooltip="英雄根据敌方生物身上的标记数量获得 %buff.buff.stat %buff.buff.stat.icon 魔力，持续到战斗回合结束。"

[A_Enliven_buff H7BaseBuff]
mName="生机勃勃"
mTooltip="%stat1 %stat1.icon 移动力\n%stat2 %stat2.icon 主动性"

[A_NaturesRevenge_WarfareUnitAbility_1_Novice H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="自然标记施加能力"
mTooltip=""

[A_NaturesRevenge_WarfareUnitAbility_3_Master H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName=""
mTooltip=""

[A_Impede_Buff_2Marks H7BaseBuff]
mName="重重掣肘"
mTooltip=""

[A_NaturesRevenge_Buff_Marker H7BaseBuff]
mName="自然复仇"
mTooltip="被生物能力用来检查生物是否有任何数量的标记。对森林弩车施加“快速装填”增益。"

[A_NaturesRevenge_CreatureAbility_1_Novice H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName=""
mTooltip=""

[A_Impede_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="重重掣肘"
mTooltip="被标记的敌方生物还有 %buff.buff.buff5.buff.stat %buff.buff.buff5.buff.stat.icon 移动力。"

[A_Impede_Buff_1Mark H7BaseBuff]
mName="重重掣肘"
mTooltip=""

[A_MarkOfTheAvenger_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="复仇标记"
mTooltip="英雄的攻击额外标记目标生物。"

[A_NaturesLuck_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="自然之幸"
mTooltip="友方生物攻击带有3个标记的敌方生物时总是造成暴击。"

[A_NaturesRevenge_CreatureAbility_2_Expert H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName=""
mTooltip=""

[A_Enliven_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="生机勃勃"
mTooltip="远古树精的复苏能力额外授予目标生物 %buff.buff.stat1 %buff.buff.stat1.icon 移动力和 %buff.buff.stat2 %buff.buff.stat2.icon 主动性。"

[A_NaturesRevenge_Skill H7Skill]
mDescriptions[0]="攻击敌方生物会标记它们的弱点。这允许友方生物更有效地攻击，敌方身上的标记越多效果越好。"
mDescriptions[1]=""
mDescriptions[2]="敌方生物在成为友方生物攻击或能力的目标后最多获得1个标记。攻击被标记生物的生物从目标身上的每个标记中获得 %spell4.spell.special1.val1 %ICON_ATTACK 攻击受益。标记持续到战斗回合结束。"
mDescriptions[3]="敌方生物最多可以获得2个标记。"
mDescriptions[4]="敌方生物最多可以获得3个标记。"
mName="自然复仇"
mTooltip="森林族技能。"

[A_Impede_Buff_3Marks H7BaseBuff]
mName="重重掣肘"
mTooltip=""

[A_NaturesRevenge_CreatureAbility_AttackIncrease H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName=""
mTooltip=""

[A_NaturesWrath_Buff_3Marks H7BaseBuff]
mName="自然之怒"
mTooltip=""

[A_Sting_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="钉刺"
mTooltip="在每个战斗回合结束时，每个敌方生物根据其身上的标记数量受到 %buff.buff.d.max %buff.buff.d.icon 土系伤害。"

[A_NaturesLuck_Buff H7BaseBuff]
mName="自然之幸"
[A_NaturesRevenge_AttackBuff_1Mark H7BaseBuff]
mName="自然复仇 (1)"
[A_NaturesRevenge_AttackBuff_2Marks H7BaseBuff]
mName="自然复仇 (2)"
[A_NaturesRevenge_AttackBuff_3Marks H7BaseBuff]
mName="自然复仇 (3)"


v1.38.3

[A_NaturesRevenge_Buff_1Mark H7BaseBuff]
mName="自然复仇 (1)"
mTooltip="+6 %ICON_ATTACK 攻击，对此生物的敌人有效。\n持续到战斗回合结束。"

[A_NaturesRevenge_Buff_2Marks H7BaseBuff]
mName="自然复仇 (2)"
mTooltip="+12 %ICON_ATTACK 攻击，对此生物的敌人有效。\n持续到战斗回合结束。"

[A_NaturesRevenge_Buff_3Marks H7BaseBuff]
mName="自然复仇 (3)"
mTooltip="+18 %ICON_ATTACK 攻击，对此生物的敌人有效。\n持续到战斗回合结束。"